Core/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>ВключаяХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/AccumulationRegisters/НалоговыеЛготы/НалоговыеЛготы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НалоговыеЛготы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЛгот</name>
    <type>
      <types>EnumRef.ТипЛгот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/InformationRegisters/НалоговыеЛготыИнформация/НалоговыеЛготыИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НалоговыеЛготыИнформация</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПодоходного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/AccumulationRegisters/РасчетыСПокупателями/РасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПокупателями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРег</name>
    <comment>Сумма в регламентированной валюте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПередачаВА</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/Закупки/Закупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Закупки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ДополнительныеРасходы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/ТипыСтруктурныхЕдиниц/ТипыСтруктурныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтруктурныхЕдиниц</name>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>Розница</name>
  </enumValues>
  <enumValues>
    <name>РозницаСуммовойУчет</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>ОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НаЭкспорт</name>
  </enumValues>
</mdclass:Enum>

Core/src/CommonModules/РС_ОбщегоНазначения/Module.bsl
//Проверяет уникальность реквизита
Функция РеквизитУникален(Ссылка, РеквизитИмя, РеквизитЗначение, ИмяСправочника) Экспорт
	
	Если Не ЗначениеЗаполнено(РеквизитЗначение) Тогда
		Возврат Истина; 
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
					|	Мета.Ссылка
					|ИЗ
					|	Справочник." + ИмяСправочника + " КАК Мета
		            |ГДЕ
		            |	НЕ Мета.Ссылка = &Ссылка
					|	И НЕ Мета.ПометкаУдаления
		            |	И Мета." + РеквизитИмя + " = &РеквизитЗначение";
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("РеквизитЗначение",	РеквизитЗначение);
	
	Возврат Запрос.Выполнить().Пустой();
					
КонецФункции

Функция получитьДопСвойство(ТекОбъект, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)  Экспорт
	
	Перем ЗначениеСвойства;
	
	Если Не ТекОбъект.ДополнительныеСвойства.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
		ЗначениеСвойства = ЗначениеПоУмолчанию; 			
	КонецЕсли;
	
	Возврат ЗначениеСвойства;	
		
КонецФункции


Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено, ОтборПоПериоду = Ложь) Экспорт
	
	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		Если ОтборПоПериоду Тогда
			УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
			УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение.ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);		
		Иначе
		    УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля) Экспорт
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Счетчик = 1;
	Пока Счетчик <= Список.Отбор.Элементы.Количество() Цикл
		ЭлементОтбора = Список.Отбор.Элементы[Счетчик - 1];
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено) Экспорт
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	Возврат Ссылка[ИмяРеквизита];
КонецФункции

Функция ПолучитьЗначенияРеквизитов(Ссылка, Реквизиты) Экспорт

	МассивИменРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Реквизиты, ",");
	
	СтруктураРеквизитов = Новый Структура;
	Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
		СтруктураРеквизитов.Вставить(ИмяРеквизита, Ссылка[ИмяРеквизита]);
	КонецЦикла;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

Функция ПолучитьСкладПоАдресу(Адрес) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка КАК Склад
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
		|ГДЕ
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы)
		|	И СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|	И СтруктурныеЕдиницыКонтактнаяИнформация.Представление = &Адрес";
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Склад;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика, Серия) Экспорт

	СтрПредставление = СокрЛП(Номенклатура.Наименование);

	Если ЗначениеЗаполнено(Характеристика)Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Характеристика.Наименование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Серия) Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Серия.Наименование);
	КонецЕсли;

	Возврат СтрПредставление;

КонецФункции

Процедура ЗаполнитьЦену(СтрокаТЧ, ВидЦены) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ВидЦены) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена     = 0;
		СтрокаТЧ.Сумма    = 0;
		СтрокаТЧ.СуммаНДС = 0;
		Возврат;
	КонецЕсли;
	
	Цены = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(, Новый Структура("ВидЦен, Номенклатура, Характеристика", ВидЦены, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика));
	Если Не Цены.Количество() = 0 Тогда
		СтрокаТЧ.СтавкаНДС	= СтрокаТЧ.Номенклатура.СтавкаНДС;
		СтавкаНДС = СтрокаТЧ.СтавкаНДС.Ставка;
		СтрокаТЧ.Цена     	= Цены[0].Цена;
		СтрокаТЧ.Сумма    	= СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		СтрокаТЧ.СуммаНДС 	= Окр(СтрокаТЧ.Сумма  * СтавкаНДС/(100 + СтавкаНДС), 2);
	Иначе
		СтрокаТЧ.Цена     = 0;
		СтрокаТЧ.Сумма    = 0;
		СтрокаТЧ.СуммаНДС = 0;
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьФИОФизЛиц(ФизЛицо, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Фамилия КАК ИмяФамилия
		|ИЗ
		|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИмяФамилия;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначенииСтавок(СтавкаНДС	 = 0, ВидУдержанияНДФЛ	    = 0, ВидУдержанияПФ		= 0,
							   ПредСтавкаНДС = 0, ПредВидУдержанияНДФЛ	= 0, ПредВидУдержанияПФ	= 0) Экспорт

	СтруктураСтавок = Новый Структура;
	Если НЕ СтавкаНДС = 0 Тогда
		СтруктураСтавок.Вставить("СтавкаНДС",		СтавкаНДС.Ставка);
	КонецЕсли;
	Если НЕ ПредСтавкаНДС = 0 Тогда
		СтруктураСтавок.Вставить("ПредСтавкаНДС",	ПредСтавкаНДС.Ставка);
	//+++ Дмгг
	Иначе
		СтруктураСтавок.Вставить("ПредСтавкаНДС",	0);
	КонецЕсли;
	
	Если НЕ ВидУдержанияНДФЛ = 0 Тогда
		СтруктураСтавок.Вставить("СтавкаНДФЛ",		ВидУдержанияНДФЛ.СтавкаНДФЛ);
	КонецЕсли;
	Если НЕ ПредВидУдержанияНДФЛ = 0 Тогда
		СтруктураСтавок.Вставить("ПредСтавкаНДФЛ",	ПредВидУдержанияНДФЛ.СтавкаНДФЛ);
		//+++ Дмгг
	Иначе
		СтруктураСтавок.Вставить("ПредСтавкаНДФЛ",	0);
	КонецЕсли;
	
	Если НЕ ВидУдержанияПФ = 0 Тогда
		СтруктураСтавок.Вставить("СтавкаПФ",		ВидУдержанияПФ.СтавкаПФ);
	КонецЕсли;
	Если НЕ ПредВидУдержанияПФ = 0 Тогда
		СтруктураСтавок.Вставить("ПредСтавкаПФ",	ПредВидУдержанияПФ.СтавкаПФ);
		//+++ Дмгг
	Иначе
		СтруктураСтавок.Вставить("ПредСтавкаПФ",	0);
	КонецЕсли;

	Возврат СтруктураСтавок;
	
КонецФункции

Процедура ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная(ИмяПоля, ТекДанные, СуммаВключаетНДС = Ложь) Экспорт

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ);
	ПересчитатьЦену = Истина;
	
	Если ИмяПоля = "СуммаБезНалогов" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "СтавкаНДС" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "ВидУдержанияПФ" Тогда
		СуммаБезНалогов = ТекДанные.СуммаБезНалогов;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	ИначеЕсли ИмяПоля = "Всего" Тогда
		Всего			= ТекДанные.Всего;
		СуммаНДС		= Окр(Всего * Ставки.СтавкаНДС/(100 + Ставки.СтавкаНДС), 2);		
		СуммаПФ			= Окр((Всего - СуммаНДС) * Ставки.СтавкаПФ/100, 2);
		СуммаНДФЛ		= Окр((Всего - СуммаПФ - СуммаНДС) * Ставки.СтавкаНДФЛ/100, 2);
		СуммаБезНалогов = Всего - СуммаПФ - СуммаНДС - СуммаНДФЛ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	ИначеЕсли ИмяПоля = "Сумма" Тогда
		СуммаБезНалогов = ?(СуммаВключаетНДС, 
						  Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2),
						  ТекДанные.Сумма);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		
		//+++ Дмгг проверка на сьеденный тетри при округлении
		Если (СуммаБезНалогов + СуммаНДС) <> ТекДанные.Сумма Тогда 
			РазницаСумм = ТекДанные.Сумма - (СуммаБезНалогов + СуммаНДС);
			СуммаНДС 	= СуммаНДС + РазницаСумм;
			Сумма		= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
			Всего		= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		КонецЕсли;
		//--- Дмгг
	ИначеЕсли ИмяПоля = "СкидкаПроцент" ИЛИ ИмяПоля = "ПроцентСкидкиНаценки" ИЛИ ИмяПоля = "Цена" ИЛИ ИмяПоля = "СкидкаСумма" ИЛИ ИмяПоля = "Количество" Тогда
		Сумма			= Окр(ТекДанные.Цена * ТекДанные.Количество * (100 - ТекДанные.ПроцентСкидкиНаценки)/100, 2);
		Если СуммаВключаетНДС Тогда
			СуммаБезНалогов = Окр(Сумма /(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
			СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
			СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
			СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			//Прибавить копейку
			Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
			СуммаНДС		= СуммаНДС + Погрешность;
			//Прибавить копейку
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		Иначе
			СуммаБезНалогов = Сумма;
			СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
			СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
			СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		КонецЕсли;
		ПересчитатьЦену = Ложь;
	Иначе
		СуммаБезНалогов = ?(СуммаВключаетНДС, 
						  Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2),
						  ТекДанные.Сумма);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов;
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	КонецЕсли;
	
	ТекДанные.Сумма				= Сумма;
	ТекДанные.СуммаБезНалогов	= СуммаБезНалогов;
	ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	ТекДанные.СуммаНДС			= СуммаНДС;
	ТекДанные.СуммаПФ			= СуммаПФ;
	ТекДанные.Всего				= Всего;
	Если ПересчитатьЦену Тогда
		Если ТекДанные.ПроцентСкидкиНаценки = 0 Тогда
			ТекДанные.Цена 	= ?(ТекДанные.Количество = 0, 0, Окр(ТекДанные.Сумма/ТекДанные.Количество, 2));
		ИначеЕсли НЕ ТекДанные.ПроцентСкидкиНаценки = 0 И НЕ ТекДанные.Количество = 0 Тогда
			ТекДанные.Цена	= ТекДанные.Сумма / ((1 - ТекДанные.ПроцентСкидкиНаценки / 100) * ТекДанные.Количество);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСуммыСтрокиРасхода_ДополнительныеРасходы(ИмяПоля, ТекДанные, СуммаВключаетНДС = Ложь) Экспорт

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ);
	ПересчитатьЦену = Истина;
	
	Если ИмяПоля = "СуммаБезНалогов" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "СтавкаНДС" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "ВидУдержанияПФ" Тогда
		СуммаБезНалогов = ТекДанные.СуммаБезНалогов;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	ИначеЕсли ИмяПоля = "Всего" Тогда
		Всего			= ТекДанные.Всего;
		СуммаНДС		= Окр(Всего * Ставки.СтавкаНДС/(100 + Ставки.СтавкаНДС), 2);		
		СуммаПФ			= Окр((Всего - СуммаНДС) * Ставки.СтавкаПФ/100, 2);
		СуммаНДФЛ		= Окр((Всего - СуммаПФ - СуммаНДС) * Ставки.СтавкаНДФЛ/100, 2);
		СуммаБезНалогов = Всего - СуммаПФ - СуммаНДС - СуммаНДФЛ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	ИначеЕсли ИмяПоля = "Сумма" Тогда
		СуммаБезНалогов = ?(СуммаВключаетНДС, 
						  Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2),
						  ТекДанные.Сумма);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	ИначеЕсли ИмяПоля = "Цена" ИЛИ ИмяПоля = "Количество" Тогда
		Сумма			= Окр(ТекДанные.Цена * ТекДанные.Количество, 2);
		Если СуммаВключаетНДС Тогда
			СуммаБезНалогов = Окр(Сумма /(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
			СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
			СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
			СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			//Прибавить копейку
			Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
			СуммаНДС		= СуммаНДС + Погрешность;
			//Прибавить копейку
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		Иначе
			СуммаБезНалогов = Сумма;
			СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
			СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
			СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		КонецЕсли;
		ПересчитатьЦену = Ложь;
	Иначе
		СуммаБезНалогов = ?(СуммаВключаетНДС, 
						  Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2),
						  ТекДанные.Сумма);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов;
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	КонецЕсли;
	
	ТекДанные.Сумма				= Сумма;
	ТекДанные.СуммаБезНалогов	= СуммаБезНалогов;
	ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	ТекДанные.СуммаНДС			= СуммаНДС;
	ТекДанные.СуммаПФ			= СуммаПФ;
	ТекДанные.Всего				= Всего;
	Если ПересчитатьЦену Тогда
		ТекДанные.Цена 	= ?(ТекДанные.Количество = 0, 0, Окр(ТекДанные.Сумма/ТекДанные.Количество, 2));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета(ИмяПоля, ТекДанные, ИспользоватьНулевуеПредЗначения = ЛОЖЬ) Экспорт
//Процедура ПересчитатьСуммыСтроки_РасходИзКассы_РасходСоСчета(ИмяПоля, ТекДанные) Экспорт


	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//+++ Дмгг
	Если ИспользоватьНулевуеПредЗначения Тогда 
		
		Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ, 0, 0, 0);
		
	Иначе
		
		Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ, ТекДанные.ПредСтавкаНДС, ТекДанные.ПредВидУдержанияНДФЛ, ТекДанные.ПредВидУдержанияПФ);
		
	КонецЕсли;
	//--- Дмгг
	
	ПересчитатьЦену = Истина;
	
	Изменилась_СтавкаНДС 	= НЕ (Ставки.СтавкаНДС  = Ставки.ПредСтавкаНДС);
	Изменилась_СтавкаНДФЛ	= НЕ (Ставки.СтавкаНДФЛ = Ставки.ПредСтавкаНДФЛ);
	Изменилась_СтавкаПФ		= НЕ (Ставки.СтавкаПФ   = Ставки.ПредСтавкаПФ);
	
	Если Изменилась_СтавкаНДС ИЛИ Изменилась_СтавкаНДФЛ ИЛИ Изменилась_СтавкаПФ Тогда
		СуммаБезНалогов = Окр(ТекДанные.СуммаПлатежа/(1 + (100 * Ставки.ПредСтавкаНДС)/((100 - Ставки.ПредСтавкаНДФЛ)*(100 - Ставки.ПредСтавкаПФ))), 2);
	Иначе
		СуммаБезНалогов = Окр(ТекДанные.СуммаПлатежа/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
	КонецЕсли;
	
	Если НЕ ИспользоватьНулевуеПредЗначения Тогда//+++ Дмгг 
		ТекДанные.ПредСтавкаНДС 		= ТекДанные.СтавкаНДС;
		ТекДанные.ПредВидУдержанияПФ	= ТекДанные.ВидУдержанияПФ;
		ТекДанные.ПредВидУдержанияНДФЛ	= ТекДанные.ВидУдержанияНДФЛ;
	КонецЕсли;
	
	Если ИмяПоля = "ВидУдержанияНДФЛ" Тогда
		Если НЕ Изменилась_СтавкаНДФЛ Тогда
			Возврат;
		КонецЕсли;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов + СуммаНДС;
	ИначеЕсли ИмяПоля = "СтавкаНДС" Тогда
		Если НЕ Изменилась_СтавкаНДС Тогда
			Возврат;
		КонецЕсли;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов + СуммаНДС;
	ИначеЕсли ИмяПоля = "ВидУдержанияПФ" Тогда
		Если НЕ Изменилась_СтавкаПФ Тогда
			Возврат;
		КонецЕсли;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов + СуммаНДС;
	ИначеЕсли ИмяПоля = "СуммаПлатежа" Тогда
		Сумма			= ТекДанные.СуммаПлатежа;
		СуммаБезНалогов = Окр(ТекДанные.СуммаПлатежа/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		//Прибавить копейку
		Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
		СуммаНДС	= СуммаНДС + Погрешность;
		//Прибавить копейку
	КонецЕсли;
	
	ТекДанные.СуммаПлатежа		= Сумма;
	ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	ТекДанные.СуммаНДС			= СуммаНДС;
	ТекДанные.СуммаПФ			= СуммаПФ;
	
КонецПроцедуры

Процедура ПересчитатьСуммыСтроки_АвансовыйОтчет_Запасы(ИмяПоля, ТекДанные, СуммаВключаетНДС = Ложь) Экспорт

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ставки			= ПолучитьЗначенииСтавок(ТекДанные.СтавкаНДС,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ, ТекДанные.ПредСтавкаНДС, ТекДанные.ПредВидУдержанияНДФЛ, ТекДанные.ПредВидУдержанияПФ);
	ПересчитатьЦену = Истина;
	
	Изменилась_СтавкаНДС 	= НЕ (Ставки.СтавкаНДС  = Ставки.ПредСтавкаНДС);
	Изменилась_СтавкаНДФЛ	= НЕ (Ставки.СтавкаНДФЛ = Ставки.ПредСтавкаНДФЛ);
	Изменилась_СтавкаПФ		= НЕ (Ставки.СтавкаПФ   = Ставки.ПредСтавкаПФ);
	
	Если Изменилась_СтавкаНДС ИЛИ Изменилась_СтавкаНДФЛ ИЛИ Изменилась_СтавкаПФ Тогда
		Если СуммаВключаетНДС Тогда
			СуммаБезНалогов = Окр(ТекДанные.Сумма/(1 + (100 * Ставки.ПредСтавкаНДС)/((100 - Ставки.ПредСтавкаНДФЛ)*(100 - Ставки.ПредСтавкаПФ))), 2);
		Иначе
			СуммаБезНалогов = ТекДанные.Сумма;
		КонецЕсли;
	Иначе
		Если СуммаВключаетНДС Тогда
			СуммаБезНалогов = Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2);
		Иначе
			СуммаБезНалогов = ТекДанные.Сумма;
		КонецЕсли;
	КонецЕсли;
	ТекДанные.ПредСтавкаНДС 		= ТекДанные.СтавкаНДС;
	ТекДанные.ПредВидУдержанияПФ	= ТекДанные.ВидУдержанияПФ;
	ТекДанные.ПредВидУдержанияНДФЛ	= ТекДанные.ВидУдержанияНДФЛ;
	
	Если ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "СтавкаНДС" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "ВидУдержанияПФ" Тогда
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	ИначеЕсли ИмяПоля = "Всего" Тогда
		Всего			= ТекДанные.Всего;
		СуммаНДС		= Окр(Всего * Ставки.СтавкаНДС/(100 + Ставки.СтавкаНДС), 2);		
		СуммаПФ			= Окр((Всего - СуммаНДС) * Ставки.СтавкаПФ/100, 2);
		СуммаНДФЛ		= Окр((Всего - СуммаПФ - СуммаНДС) * Ставки.СтавкаНДФЛ/100, 2);
		СуммаБезНалогов = Всего - СуммаПФ - СуммаНДС - СуммаНДФЛ;
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
	ИначеЕсли ИмяПоля = "Сумма" Тогда
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= ?(СуммаВключаетНДС, СуммаБезНалогов + СуммаНДС, СуммаБезНалогов);
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	ИначеЕсли ИмяПоля = "Цена" ИЛИ ИмяПоля = "Количество" Тогда
		Сумма			= Окр(ТекДанные.Цена * ТекДанные.Количество, 2);
		Если СуммаВключаетНДС Тогда
			СуммаБезНалогов = Окр(Сумма/(1 + (100 * Ставки.ПредСтавкаНДС)/((100 - Ставки.ПредСтавкаНДФЛ)*(100 - Ставки.ПредСтавкаПФ))), 2);
		Иначе
			СуммаБезНалогов = Сумма;
		КонецЕсли;
		Если СуммаВключаетНДС Тогда
			СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
			СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
			СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			//Прибавить копейку
			Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
			СуммаНДС		= СуммаНДС + Погрешность;
			//Прибавить копейку
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		Иначе
			СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
			СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
			СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
			Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
		КонецЕсли;
		ПересчитатьЦену = Ложь;
	Иначе
		//СуммаБезНалогов = ?(СуммаВключаетНДС, 
		//				  Окр(ТекДанные.Сумма/(1 + (100 * Ставки.СтавкаНДС)/((100 - Ставки.СтавкаНДФЛ)*(100 - Ставки.СтавкаПФ))), 2),
		//				  ТекДанные.Сумма);
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
		СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
		Сумма			= СуммаБезНалогов;
		Всего			= СуммаБезНалогов + СуммаНДФЛ + СуммаНДС + СуммаПФ;
	КонецЕсли;
	
	ТекДанные.Сумма				= Сумма;
	//ТекДанные.СуммаБезНалогов	= СуммаБезНалогов;
	ТекДанные.СуммаРасходовНДФЛ	= СуммаНДФЛ;
	ТекДанные.СуммаНДС			= СуммаНДС;
	ТекДанные.СуммаПФ			= СуммаПФ;
	ТекДанные.Всего				= Всего;
	Если ПересчитатьЦену Тогда
		ТекДанные.Цена 	= ?(ТекДанные.Количество = 0, 0, Окр(ТекДанные.Сумма/ТекДанные.Количество, 2));
	КонецЕсли;
	
	
	
	
	//ТекДанные.ПредСтавкаНДС 		= ТекДанные.СтавкаНДС;
	//ТекДанные.ПредВидУдержанияПФ	= ТекДанные.ВидУдержанияПФ;
	//ТекДанные.ПредВидУдержанияНДФЛ	= ТекДанные.ВидУдержанияНДФЛ;
	//
	//Если ИмяПоля = "ВидУдержанияНДФЛ" Тогда
	//	Если НЕ Изменилась_СтавкаНДФЛ Тогда
	//		Возврат;
	//	КонецЕсли;
	//	СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
	//	СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	//	СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
	//	Сумма			= СуммаБезНалогов + СуммаНДС;
	//	Всего			= Сумма + СуммаПФ + СуммаНДФЛ + ?(СуммаВключаетНДС, 0, СуммаНДС);
	//ИначеЕсли ИмяПоля = "СтавкаНДС" Тогда
	//	Если НЕ Изменилась_СтавкаНДС Тогда
	//		Возврат;
	//	КонецЕсли;
	//	СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
	//	СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	//	СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
	//	Сумма			= СуммаБезНалогов + СуммаНДС;
	//ИначеЕсли ИмяПоля = "ВидУдержанияПФ" Тогда
	//	Если НЕ Изменилась_СтавкаПФ Тогда
	//		Возврат;
	//	КонецЕсли;
	//	СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
	//	СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	//	СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
	//	Сумма			= СуммаБезНалогов + СуммаНДС;
	//ИначеЕсли ИмяПоля = "Сумма" Тогда
	//	Сумма			= ТекДанные.Сумма;
	//	СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
	//	СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	//	СуммаНДС		= Окр((СуммаБезНалогов + СуммаНДФЛ + СуммаПФ) * Ставки.СтавкаНДС/100, 2);
	//	//Прибавить копейку
	//	Погрешность = Сумма - (СуммаБезНалогов + СуммаНДС);
	//	СуммаНДС	= СуммаНДС + Погрешность;
	//	//Прибавить копейку
	//ИначеЕсли ИмяПоля = "Цена" Тогда
	//	
	//	
	//ИначеЕсли ИмяПоля = "Количество" Тогда
	//	
	//КонецЕсли;
	//
	//ТекДанные.Сумма				= Сумма;
	//ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	//ТекДанные.СуммаНДС			= СуммаНДС;
	//ТекДанные.СуммаПФ			= СуммаПФ;
	//ТекДанные.Всего				= Всего;
	
КонецПроцедуры

Процедура ПересчитатьСуммыСтроки_АвансовыйОтчет_Оплата(ИмяПоля, ТекДанные) Экспорт

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ставки			= ПолучитьЗначенииСтавок( ,ТекДанные.ВидУдержанияНДФЛ, ТекДанные.ВидУдержанияПФ);
	ПересчитатьЦену = Истина;
	
	СуммаБезНалогов = ТекДанные.СуммаПлатежа;
	
	Если ИмяПоля = "ВидУдержанияНДФЛ" Тогда
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	ИначеЕсли ИмяПоля = "ВидУдержанияПФ" Тогда
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	ИначеЕсли ИмяПоля = "СуммаПлатежа" Тогда
		Сумма			= ТекДанные.СуммаПлатежа;
		СуммаНДФЛ		= Окр(СуммаБезНалогов * Ставки.СтавкаНДФЛ/(100 - Ставки.СтавкаНДФЛ), 2);
		СуммаПФ			= Окр((СуммаБезНалогов + СуммаНДФЛ) * Ставки.СтавкаПФ/(100 - Ставки.СтавкаПФ), 2);
	КонецЕсли;
	
	ТекДанные.СуммаПлатежа		= СуммаБезНалогов;
	ТекДанные.СуммаНДФЛ			= СуммаНДФЛ;
	ТекДанные.СуммаПФ			= СуммаПФ;
	
КонецПроцедуры

Функция ПолучитьСтавкиНалогов(Дата, Контрагент, Договор, Организация) Экспорт

	СтруктураВозврата = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		СтруктураВозврата.Вставить("ВидУдержанияНДФЛ",	Неопределено);
		СтруктураВозврата.Вставить("ВидУдержанияПФ",	Неопределено);
	Иначе
		СтруктураВозврата.Вставить("ВидУдержанияНДФЛ",	Договор.ВидУдержанияНДФЛ);
		СтруктураВозврата.Вставить("ВидУдержанияПФ",	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВидУдержанияПФ(Дата, Контрагент, Договор));
	КонецЕсли;
	СтруктураВозврата.Вставить("СтавкаНДС",			ПолучитьСтавкуНДСКонтрагента(Контрагент, Организация));
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСтавкуНДСКонтрагента(Контрагент, Организация) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат ?(ЗначениеЗаполнено(Организация), Организация.СтавкаНДСПоУмолчанию, Неопределено);
	Иначе
		ТипНалогооблаженияНДС = Контрагент.НалогообложениеНДС;
		Если ТипНалогооблаженияНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			Возврат УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		ИначеЕсли ТипНалогооблаженияНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
			Возврат УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		Иначе
			Возврат УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

//Паганини_
Процедура ЗапретЗаписьДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если НЕ ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Источник.ЗапретРедактированияДокументов = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалЗапретаРедактированияДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЗапретРедактированияДокументов И Не Источник.ДополнительныеСвойства.Свойство("ПроводитЗапретныеДляРедактированияДокументов") Тогда
		ТекстСообщения = НСтр("ka='მოცემული დოკუმენტი დაბლოკილია!';ru='Текущий документ заблокированн!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник.Ссылка,ТекстСообщения, , , ,Отказ);
	КонецЕсли;
			
КонецПроцедуры

Функция ПереводВДату(ДатаСтрока) Экспорт
	
	День 	= Сред(ДатаСтрока, 9, 2);
	Месяц 	= Сред(ДатаСтрока, 6, 2);
	Год 	= Сред(ДатаСтрока, 1, 4);

	Если ДатаСтрока = Неопределено или СтрДлина(ДатаСтрока) > 10 Тогда
		Час = Сред(ДатаСтрока, 12, 2);
		Минута = Сред(ДатаСтрока, 15, 2);
		Секунда = Сред(ДатаСтрока, 18, 2);
		Возврат Дата(Год, Месяц, День, Час, Минута, Секунда);
	ИначеЕсли Год <> "" и Месяц <> "" и День <> "" Тогда
		Возврат Дата(Год, Месяц, День);
	Иначе
		Возврат Дата('00010101');
	КонецЕсли;
	
КонецФункции
//_Паганини

Функция ПолучитьСуммоНалоговыхЛгот(Организация,Сотрудник,Подразделение,Дата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(НалоговыеЛготы.Сумма) КАК Сумма,
	               |	НалоговыеЛготы.Организация,
	               |	НалоговыеЛготы.Сотрудник,
	               |	НалоговыеЛготы.Подразделение
	               |ПОМЕСТИТЬ ВТНачисленно
	               |ИЗ
	               |	РегистрНакопления.НалоговыеЛготы КАК НалоговыеЛготы
	               |ГДЕ
	               |	НалоговыеЛготы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |	И НалоговыеЛготы.Период < &Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НалоговыеЛготы.Организация,
	               |	НалоговыеЛготы.Сотрудник,
	               |	НалоговыеЛготы.Подразделение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(НалоговыеЛготыИнформацияСрезПоследних.Сумма - ЕСТЬNULL(НалоговыеЛготыОстатки.Сумма, 0)), 0) КАК Сумма,
	               |	НалоговыеЛготыИнформацияСрезПоследних.ПроцентПодоходного
	               |ИЗ
	               |	РегистрСведений.НалоговыеЛготыИнформация.СрезПоследних(
	               |			&Дата,
	               |			Подразделение = &Подразделение
	               |				И Сотрудник = &Сотрудник
	               |				И Организация = &Организация) КАК НалоговыеЛготыИнформацияСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленно КАК НалоговыеЛготыОстатки
	               |		ПО НалоговыеЛготыИнформацияСрезПоследних.Организация = НалоговыеЛготыОстатки.Организация
	               |			И НалоговыеЛготыИнформацияСрезПоследних.Сотрудник = НалоговыеЛготыОстатки.Сотрудник
	               |			И НалоговыеЛготыИнформацияСрезПоследних.Подразделение = НалоговыеЛготыОстатки.Подразделение
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НалоговыеЛготыИнформацияСрезПоследних.ПроцентПодоходного";
				   
				   
				   
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("Дата",Дата);
    Запрос.УстановитьПараметр("Организация",Организация);	
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Сумма",0);
	СтруктураОтвета.Вставить("ПроцентПодоходного",0);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета,Выборка);
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции	

Процедура ПроверкаСуммиИДниЗадолженности(ДокументСсылка, Отказ) Экспорт 
	
	ТекстСообщение = "";
	НачалоПериодКонтроляЛимитов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("НачалоПериодаКонтроляЛимитовЗадолжностиПокупателей");
	Если НачалоДня(ДокументСсылка.Дата) < НачалоПериодКонтроляЛимитов Тогда 
		Возврат;
	КонецЕсли;
	Договор = ДокументСсылка.Договор;
		
	Если Договор.ДопустимыйЛимитЗадолженностиОтПокупателя > 0 Тогда 
		ОстатокЛимита = Договор.ДопустимыйЛимитЗадолженностиОтПокупателя;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыСПокупателямиОстатки.Организация,
			|	РасчетыСПокупателямиОстатки.Договор,
			|	РасчетыСПокупателямиОстатки.СуммаОстаток КАК Сумма,
			|	РасчетыСПокупателямиОстатки.СуммаВалОстаток КАК СуммаВал
			|ИЗ
			|	РегистрНакопления.РасчетыСПокупателями.Остатки(
			|			&Дата,
			|			Организация = &Организация
			|				И Договор = &Договор) КАК РасчетыСПокупателямиОстатки";
		Запрос.УстановитьПараметр("Договор", 		Договор);
		Запрос.УстановитьПараметр("Дата", 			ДокументСсылка.Дата);
		Запрос.УстановитьПараметр("Организация",	ДокументСсылка.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ОстатокЛимита = Договор.ДопустимыйЛимитЗадолженностиОтПокупателя - Выборка.Сумма;
		КонецЕсли;
		Если ОстатокЛимита < 0 ИЛИ ОстатокЛимита < ДокументСсылка.СуммаДокумента Тогда
			Отказ = Истина;
			врТекстСообщение = НСтр("ru = 'Задолжность превышает сумму лимита на текущий договор на сумму '; ka = 'დავალიანება მოცემული ხელშეკრულებისთვის აჭარბებს დასაშვებ ლიმიტს თანხით '") + Строка((ОстатокЛимита-ДокументСсылка.СуммаДокумента)*-1);
			ТекстСообщение = ?(ТекстСообщение = "",врТекстСообщение,ТекстСообщение+Символы.ПС+врТекстСообщение);
		КонецЕсли;
	КонецЕсли;
		
	Если Договор.СрокОплатыПокупателя > 0 Тогда
		Если Не Договор.Владелец.ВестиРасчетыПоДокументам Тогда
			врТекстСообщение = НСтр("ka='თუ ხელშეკრულებაში მითითებულია დღეების ლიმიტი, აუცილებელია აღრიცხვა წარმოებდეს დოკუმენტების მიხედვით.';ru='Если в договоре указан срок оплаты покупателя, обязательно учет проводить по документам.'");
			ТекстСообщение = ?(ТекстСообщение = "",врТекстСообщение,ТекстСообщение+Символы.ПС+врТекстСообщение);
			Отказ = Истина;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасчетыСПокупателямиОстатки.Договор,
		               |	МИНИМУМ(РасчетыСПокупателямиОстатки.Документ.Дата) КАК ДатаПервДок
		               |ПОМЕСТИТЬ врТаб
		               |ИЗ
		               |	РегистрНакопления.РасчетыСПокупателями.Остатки(&Дата, Договор = &Договор) КАК РасчетыСПокупателямиОстатки
		               |ГДЕ
		               |	НЕ РасчетыСПокупателямиОстатки.Документ.Дата ЕСТЬ NULL
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыСПокупателямиОстатки.Договор
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	врТаб.Договор,
		               |	врТаб.ДатаПервДок,
		               |	РАЗНОСТЬДАТ(врТаб.ДатаПервДок, &Дата, ДЕНЬ) КАК РазностьДатВДнях
		               |ИЗ
		               |	врТаб КАК врТаб";
		Запрос.УстановитьПараметр("Договор", 	ДокументСсылка.Договор);
		Запрос.УстановитьПараметр("Дата", 		ДокументСсылка.Дата);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.РазностьДатВДнях > 0 И Выборка.РазностьДатВДнях > Договор.СрокОплатыПокупателя  Тогда
				Отказ = Истина;
				врТекстСообщение = НСтр("ru = 'Дата задолжности превышает лимита дней на '; ka = 'დავალიანება აჭარბებს დასაშვებ დროით ლიმიტს '") + 
								   Строка(Выборка.РазностьДатВДнях - Договор.СрокОплатыПокупателя) + НСТР("ru = ' дня'; ka = ' დღით'");
				ТекстСообщение = ?(ТекстСообщение = "",врТекстСообщение,ТекстСообщение+Символы.ПС+врТекстСообщение);
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ТекстСообщение = "" Тогда
		Сообщить(ТекстСообщение, СтатусСообщения.Важное);
	КонецЕсли;
		

КонецПроцедуры
//_Паганини

&НаСервере
Функция ПолучитьСуммуИНДСДокументаВВалютеРасчета(Документ) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(Закупки.Сумма) КАК Сумма,
	               |	СУММА(Закупки.СуммаНДС) КАК СуммаНДС
	               |ИЗ
	               |	РегистрНакопления.Закупки КАК Закупки
	               |ГДЕ
	               |	Закупки.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор",Документ);
	
	СтруктураОтвета = Новый Структура;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураОтвета.Вставить("Сумма",Выборка.Сумма);
		СтруктураОтвета.Вставить("СуммаНДС",Выборка.СуммаНДС);
		СтруктураОтвета.Вставить("СуммаВсего",Выборка.Сумма);
	Иначе
		СтруктураОтвета.Вставить("Сумма",0);
		СтруктураОтвета.Вставить("СуммаНДС",0);
		СтруктураОтвета.Вставить("СуммаВсего",0);
	КонецЕсли;	
	
	Возврат СтруктураОтвета;	
	
КонецФункции
